### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.apim_external.azurerm_api_management_api.api_services_app_backend will be created
  + resource "azurerm_api_management_api" "api_services_app_backend" {
      + api_management_name   = "io-p-itn-apim-01"
      + api_type              = (known after apply)
      + description           = "IO Services App Backend API"
      + display_name          = "IO Services App Backend"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-services-app-backend-api"
      + path                  = "api/catalog"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + subscription_required = false
      + version               = "v1"
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi"
          + content_value  = <<-EOT
                openapi: 3.0.2
                servers:
                  - url: https://api-app.io.pagopa.it/api/catalog/v1
                info:
                  title: Services App Backend API
                  version: 2.0.0
                tags:
                  - name: search
                    description: Search APIs
                  - name: details
                    description: Retrieve resources details
                  - name: featured
                    description: Retrieve featured Lists
                security:
                  - ApiKeyAuth: []
                paths:
                  /institutions:
                    get:
                      tags:
                        - search
                      summary: Find institutions
                      description: Multiple status values can be provided with comma separated strings
                      operationId: findInstitutions
                      parameters:
                        - name: search
                          in: query
                          description: A full-text search query expression
                          required: false
                          schema:
                            type: string
                        - name: scope
                          in: query
                          description: Institution scope
                          required: false
                          schema:
                            $ref: '#/components/schemas/ScopeType'
                        - name: limit
                          in: query
                          description: >-
                            The number of search results to retrieve. This can be used in
                            conjunction with skip to implement client-side paging of search
                            results
                            (https://docs.oasis-open.org/odata/odata/v4.01/odata-v4.01-part2-url-conventions.html#sec_SystemQueryOptionstopandskip).
                          required: false
                          schema:
                            type: integer
                            minimum: 1
                            maximum: 100
                            default: 20
                        - name: offset
                          in: query
                          description: >-
                            The number of search results to skip
                            (https://docs.oasis-open.org/odata/odata/v4.01/odata-v4.01-part2-url-conventions.html#sec_SystemQueryOptionstopandskip).
                            This value cannot be greater than 100,000.
                          required: false
                          schema:
                            type: integer
                            minimum: 0
                            maximum: 100
                            default: 0
                        - name: sessionId
                          in: query
                          description: An unique identifier of the session
                          required: false
                          schema:
                            type: string
                            minLength: 1
                      responses:
                        '200':
                          description: successful operation
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/InstitutionsResource'
                        '400':
                          description: Bad Request
                        '401':
                          description: API key null or expired
                        '500':
                          description: Internal Server Error
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJson'
                        '502':
                          description: Bad gateway
                        '504':
                          description: Gateway timeout
                  /institutions/featured:
                    get:
                      tags:
                        - featured
                      summary: Retrieve featured intitutions
                      operationId: getFeaturedInstitutions
                      responses:
                        '200':
                          description: successful operation
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/Institutions'
                        '401':
                          description: API key null or expired
                        '500':
                          description: Internal Server Error
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJson'
                        '502':
                          description: Bad gateway
                        '504':
                          description: Gateway timeout
                  /institutions/{institutionId}/services:
                    get:
                      tags:
                        - search
                      summary: Find services for institution
                      description: Given an Institution allow to find its services
                      operationId: findInstutionServices
                      parameters:
                        - name: institutionId
                          in: path
                          description: ID of the institution to search for services
                          required: true
                          schema:
                            type: string
                        - name: limit
                          in: query
                          description: >-
                            The number of search results to retrieve. This can be used in
                            conjunction with skip to implement client-side paging of search
                            results
                            (https://docs.oasis-open.org/odata/odata/v4.01/odata-v4.01-part2-url-conventions.html#sec_SystemQueryOptionstopandskip).
                          required: false
                          schema:
                            type: integer
                            minimum: 1
                            maximum: 100
                            default: 20
                        - name: offset
                          in: query
                          description: >-
                            The number of search results to skip
                            (https://docs.oasis-open.org/odata/odata/v4.01/odata-v4.01-part2-url-conventions.html#sec_SystemQueryOptionstopandskip).
                            This value cannot be greater than 100,000.
                          required: false
                          schema:
                            type: integer
                            minimum: 0
                            maximum: 100
                            default: 0
                        - name: sessionId
                          in: query
                          description: An unique identifier of the session
                          required: false
                          schema:
                            type: string
                            minLength: 1
                      responses:
                        '200':
                          description: successful operation
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/InstitutionServicesResource'
                        '400':
                          description: Bad Request
                        '401':
                          description: API key null or expired
                        '500':
                          description: Internal Server Error
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJson'
                        '502':
                          description: Bad gateway
                        '504':
                          description: Gateway timeout
                  /services/featured:
                    get:
                      tags:
                        - featured
                      summary: Retrieve featured services
                      operationId: getFeaturedServices
                      responses:
                        '200':
                          description: successful operation
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/FeaturedServices'
                        '401':
                          description: API key null or expired
                        '500':
                          description: Internal Server Error
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJson'
                        '502':
                          description: Bad gateway
                        '504':
                          description: Gateway timeout
                  /services/{serviceId}:
                    get:
                      tags:
                        - details
                      summary: Retrieve service details
                      description: Retrieve a service by ID
                      operationId: getServiceById
                      parameters:
                        - name: serviceId
                          in: path
                          description: ID of service to return
                          required: true
                          schema:
                            type: string
                      responses:
                        '200':
                          description: successful operation
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ServiceDetails'
                        '401':
                          description: API key null or expired
                        '404':
                          description: Not found
                        '500':
                          description: Internal Server Error
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJson'
                        '502':
                          description: Bad gateway
                        '504':
                          description: Gateway timeout
                components:
                  securitySchemes:
                    ApiKeyAuth:
                      type: apiKey
                      in: header
                      name: X-Functions-Key
                  schemas:
                    InstitutionsResource:
                      allOf:
                        - $ref: '#/components/schemas/Institutions'
                        - $ref: '#/components/schemas/PaginationResultSet'
                    Institutions:
                      type: object
                      properties:
                        institutions:
                          type: array
                          items:
                            $ref: '#/components/schemas/Institution'
                      required:
                        - institutions
                    Institution:
                      type: object
                      properties:
                        id:
                          type: string
                          description: Institution ID
                        name:
                          type: string
                          description: Institution Name
                        fiscal_code:
                          $ref: '#/components/schemas/OrganizationFiscalCode'
                      required:
                        - id
                        - name
                        - fiscal_code
                    InstitutionServicesResource:
                      allOf:
                        - $ref: '#/components/schemas/Services'
                        - $ref: '#/components/schemas/PaginationResultSet'
                    Services:
                      type: object
                      properties:
                        services:
                          type: array
                          items:
                            $ref: '#/components/schemas/ServiceMinified'
                      required:
                        - services
                    ServiceMinified:
                      type: object
                      description: Service data (minified)
                      properties:
                        id:
                          $ref: '#/components/schemas/ServiceId'
                        name:
                          type: string
                          description: Service Name
                          example: Tari
                        version:
                          type: integer
                          description: Service Version
                      required:
                        - id
                        - name
                        - version
                    ServiceDetails:
                      type: object
                      properties:
                        id:
                          $ref: '#/components/schemas/ServiceId'
                        name:
                          type: string
                          description: Service name
                        description:
                          type: string
                          description: Service description
                        organization:
                          $ref: '#/components/schemas/Organization'
                        metadata:
                          $ref: '#/components/schemas/ServiceMetadata'
                      required:
                        - id
                        - name
                        - description
                        - organization
                        - metadata
                    FeaturedServices:
                      type: object
                      properties:
                        services:
                          type: array
                          items:
                            $ref: '#/components/schemas/FeaturedService'
                      required:
                        - services
                    FeaturedService:
                      allOf:
                        - $ref: '#/components/schemas/ServiceMinified'
                        - type: object
                          properties:
                            organization_name:
                              type: string
                              description: Organization Name
                    ServiceMetadata:
                      description: A set of service metadata properties
                      x-one-of: true
                      allOf:
                        - $ref: '#/components/schemas/StandardServiceMetadata'
                        - $ref: '#/components/schemas/SpecialServiceMetadata'
                    StandardServiceMetadata:
                      allOf:
                        - $ref: '#/components/schemas/ServiceBaseMetadata'
                        - type: object
                          properties:
                            category:
                              $ref: '#/components/schemas/StandardServiceCategory'
                          required:
                            - category
                    StandardServiceCategory:
                      type: string
                      x-extensible-enum:
                        - STANDARD
                    SpecialServiceMetadata:
                      allOf:
                        - $ref: '#/components/schemas/ServiceBaseMetadata'
                        - type: object
                          properties:
                            category:
                              $ref: '#/components/schemas/SpecialServiceCategory'
                            custom_special_flow:
                              type: string
                              minLength: 1
                          required:
                            - category
                    SpecialServiceCategory:
                      type: string
                      x-extensible-enum:
                        - SPECIAL
                    ServiceBaseMetadata:
                      type: object
                      description: A set of common service metadata properties
                      properties:
                        web_url:
                          type: string
                          minLength: 1
                        app_ios:
                          type: string
                          minLength: 1
                        app_android:
                          type: string
                          minLength: 1
                        tos_url:
                          type: string
                          minLength: 1
                        privacy_url:
                          type: string
                          minLength: 1
                        address:
                          type: string
                          minLength: 1
                        phone:
                          type: string
                          minLength: 1
                        email:
                          type: string
                          minLength: 1
                        pec:
                          type: string
                          minLength: 1
                        cta:
                          type: string
                          minLength: 1
                        token_name:
                          type: string
                          minLength: 1
                        support_url:
                          type: string
                          minLength: 1
                        scope:
                          $ref: '#/components/schemas/ScopeType'
                      required:
                        - scope
                    Organization:
                      type: object
                      properties:
                        name:
                          type: string
                          minLength: 1
                        fiscal_code:
                          $ref: '#/components/schemas/OrganizationFiscalCode'
                      required:
                        - name
                        - fiscal_code
                    OrganizationFiscalCode:
                      type: string
                      x-import: '@pagopa/ts-commons/lib/strings'
                      format: OrganizationFiscalCode
                    PaginationResultSet:
                      type: object
                      properties:
                        offset:
                          type: number
                          description: result set offset
                        limit:
                          type: number
                          description: result set size
                        count:
                          type: number
                          description: total record count
                      required:
                        - offset
                        - limit
                        - count
                    ScopeType:
                      type: string
                      description: Institutions/Services Scopes
                      enum:
                        - NATIONAL
                        - LOCAL
                    ServiceId:
                      type: string
                      description: |-
                        The ID of the Service. Equals the subscriptionId of a registered
                        API user.
                      minLength: 1
                    ProblemJson:
                      type: object
                      properties:
                        type:
                          type: string
                          format: uri
                          description: |-
                            An absolute URI that identifies the problem type. When dereferenced,
                            it SHOULD provide human-readable documentation for the problem type
                            (e.g., using HTML).
                          default: about:blank
                          example: https://example.com/problem/constraint-violation
                        title:
                          type: string
                          description: >-
                            A short, summary of the problem type. Written in english and
                            readable
                
                            for engineers (usually not suited for non technical stakeholders and
                
                            not localized); example: Service Unavailable
                        status:
                          type: integer
                          format: int32
                          description: >-
                            The HTTP status code generated by the origin server for this
                            occurrence of the problem.
                          minimum: 100
                          maximum: 600
                          exclusiveMaximum: true
                          example: 200
                        detail:
                          type: string
                          description: |-
                            A human readable explanation specific to this occurrence of the
                            problem.
                          example: There was an error processing the request
                        instance:
                          type: string
                          format: uri
                          description: >-
                            An absolute URI that identifies the specific occurrence of the
                            problem.
                
                            It may or may not yield further information if dereferenced.
            EOT
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.apim_external.azurerm_api_management_api_policy.app_backend will be created
  + resource "azurerm_api_management_api_policy" "app_backend" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-services-app-backend-api"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <set-backend-service backend-id="{{backend-id}}" />
                    <set-header name="x-functions-key" exists-action="override">
                        <value>{{appbe-host-key-for-apim-platform}}</value>
                    </set-header>
                    <rewrite-uri template="@(context.Request.Url.Path.Replace("/catalog", ""))" />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.apim_external.azurerm_api_management_api_version_set.io_services_app_backend_v1 will be created
  + resource "azurerm_api_management_api_version_set" "io_services_app_backend_v1" {
      + api_management_name = "io-p-itn-apim-01"
      + display_name        = "IO Services App Backend v1"
      + id                  = (known after apply)
      + name                = "io_services_app_backend_v1"
      + resource_group_name = "io-p-itn-common-rg-01"
      + versioning_scheme   = "Segment"
    }

  # module.apim_external.azurerm_api_management_backend.app_backend will be created
  + resource "azurerm_api_management_backend" "app_backend" {
      + api_management_name = "io-p-itn-apim-01"
      + description         = "IO Services App Backend"
      + id                  = (known after apply)
      + name                = "io-p-itn-svc-app-be-func-01"
      + protocol            = "http"
      + resource_group_name = "io-p-itn-common-rg-01"
      + url                 = "https://io-p-itn-svc-app-be-func-01.azurewebsites.net"
    }

  # module.apim_external.azurerm_api_management_named_value.app_backend_apim_key will be created
  + resource "azurerm_api_management_named_value" "app_backend_apim_key" {
      + api_management_name = "io-p-itn-apim-01"
      + display_name        = "appbe-host-key-for-apim-platform"
      + id                  = (known after apply)
      + name                = "appbe-host-key-for-apim-platform"
      + resource_group_name = "io-p-itn-common-rg-01"
      + secret              = true
      + value               = (sensitive value)
    }

  # module.apim_external.azurerm_api_management_product_api.app_backend will be created
  + resource "azurerm_api_management_product_api" "app_backend" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-services-app-backend-api"
      + id                  = (known after apply)
      + product_id          = "io-services-api"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.container_apps.module.backend_func_itn.azapi_resource.this[0] will be updated in-place
  ~ resource "azapi_resource" "this" {
      ~ body                      = {
          ~ properties = {
              ~ template      = {
                  ~ containers                    = [
                      ~ {
                            name      = "appbackend"
                          ~ probes    = [
                              ~ {
                                  ~ failureThreshold    = 3 -> 10
                                  ~ tcpSocket           = {
                                      - port = 80
                                    } -> null
                                    # (4 unchanged attributes hidden)
                                },
                              ~ {
                                  ~ failureThreshold    = 10 -> 3
                                  ~ httpGet             = {
                                      - httpHeaders = null
                                      - path        = "/api/v1/info"
                                      - port        = 80
                                      - scheme      = "HTTP"
                                    } -> null
                                    # (3 unchanged attributes hidden)
                                },
                            ]
                            # (3 unchanged attributes hidden)
                        },
                    ]
                    # (2 unchanged attributes hidden)
                }
                # (2 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.App/containerApps/io-p-itn-svc-app-be-func-02"
        name                      = "io-p-itn-svc-app-be-func-02"
      ~ output                    = {
          - properties = {
              - configuration = {
                  - ingress = {
                      - fqdn = "io-p-itn-svc-app-be-func-02.ambitioussea-e5d71305.italynorth.azurecontainerapps.io"
                    }
                }
            }
        } -> (known after apply)
        tags                      = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 6 to add, 1 to change, 0 to destroy.

Warning: Deprecated attribute

  on .terraform/modules/cms_function_app.cms_storage_account/cmk.tf line 18, in resource "azurerm_key_vault_access_policy" "keys":
  18:   for_each     = (local.cmk_flags.kv && try(local.cmk_info.kv.same_subscription, false) && try(data.azurerm_key_vault.this["kv"].enable_rbac_authorization, false) == false ? toset(["kv"]) : toset([]))

The attribute "enable_rbac_authorization" is deprecated. Refer to the
provider documentation for details.

(and 3 more similar warnings elsewhere)

Warning: Argument is deprecated

  with module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-review-legacy-poison"],
  on .terraform/modules/cms_function_app.cms_storage_account/storage_account.tf line 157, in resource "azurerm_storage_queue" "this":
 157:   storage_account_name = azurerm_storage_account.this.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

(and 4 more similar warnings elsewhere)
```

</details>
